CHAPTER_NAME_MAP = {
    '1': 'Ανάλυση προβλήματος',
    '2': 'Βασικές έννοιες αλγορίθμων',
    '3': 'Δομές δεδομένων και Αλγόριθμοι',
    '6': 'Εισαγωγή στον προγραμματισμό',
    '7': 'Βασικές έννοιες προγραμματισμού',
    '8': 'Επιλογή και επανάληψη',
    '10': 'Υποπρογράμματα',
    'lists': 'Λίστες',
    'stack': 'Στοίβα',
    'queue': 'Ουρά',
    'trees': 'Δένδρα',
    'oop': 'Αντικειμενοστραφής προγραμματισμός',
    'debug': 'Εκσφαλμάτωση',
    'chap4': 'Εισαγωγή στον προγραμματισμό', 
    'chap5': 'Βασικές έννοιες προγραμματισμού', 
    'chap9': 'Ουρά', 
    'chap11': 'Δένδρα', 
    'chap12': 'Γράφοι', 
    'chap13': 'Τεχνικές σχεδίασης και ανάλυσης αλγορίθμων', 
    'chap14': 'Αντικειμενοστραφής προγραμματισμός', 
    'chap15': 'Εκσφαλμάτωση', 
}

URL_MAPPINGS = {

    'default_quiz': '/quiz', 
    'default_flashcard': '/flashcards', 
    
    'algorithms': '/algorithms',
    'paliathemata': '/paliathemata',
    'notes': '/notes', 
}


CHAPTERS_WITH_EXAMS = ['1', '2', '3', '6', '7', '8', '10', 'lists', 'stack', 'queue', 'trees', 'oop', 'debug']